In [1]:
import os
import sys

import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import warnings
%matplotlib inline

In [3]:
warnings.filterwarnings("ignore")

In [5]:
import pyspark
from pyspark.sql import SparkSession

In [7]:
# Initialize a spark session.
conf = pyspark.SparkConf().setMaster("local[*]")

def init_spark():
    spark = SparkSession.builder.appName("Pyspark guide").config(conf=conf).getOrCreate()
    return spark

spark = init_spark()

In [9]:
spark

In [11]:
input_path = "./data/Sales_Data.csv"

In [21]:
sales_data = spark.read.csv(input_path, header=True)

In [31]:
print("Data Schema")
sales_data.printSchema

Data Schema

<bound method DataFrame.printSchema of DataFrame[_c0: string, Order ID: string, Product: string, Quantity Ordered: string, Price Each: string, Order Date: string, Purchase Address: string, Month: string, Sales: string, City: string, Hour: string]>

In [29]:
print('Columns overview')
pd.DataFrame(sales_data.dtypes, columns = ['Column Name','Data type'])

Columns overview

         Column Name Data type
0                _c0    string
1           Order ID    string
2            Product    string
3   Quantity Ordered    string
4         Price Each    string
5         Order Date    string
6   Purchase Address    string
7              Month    string
8              Sales    string
9               City    string
10              Hour    string

In [45]:
sales_data = sales_data.select("Order ID", "Product", "Quantity Ordered", "Price Each", "Order Date", "Purchase Address", \
                              "Month", "Sales", "City", "Hour")

In [47]:
print('Data frame describe (string and numeric columns only):')
sales_data.describe().toPandas()

Data frame describe (string and numeric columns only):

,summary,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address,Month,Sales,City,Hour
0,count,185950,185950,185950,185950,185950,185950,185950,185950,185950,185950
1,mean,230417.5693788653,None,1.1243828986286637,184.39973476748673,None,None,7.059139553643453,185.49091675188888,None,14.413304651788115
2,stddev,51512.73710999645,None,0.4427926240286694,332.7313298843438,None,None,3.5029960006289547,332.9197713864798,None,5.423415962073379
3,min,141234,20in Monitor,1,109.99,2019-01-01 03:07:00,"1 11th St, Atlanta, GA 30301",1,109.99,Atlanta,0
4,max,319670,iPhone,9,999.99,2020-01-01 05:13:00,"999 Wilson St, San Francisco, CA 94016",9,999.99,Seattle,9

In [49]:
print(f'There are total {sales_data.count()} row, Let print first 2 data rows:')
sales_data.limit(2).toPandas()

There are total 185950 row, Let print first 2 data rows:

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address,Month,Sales,City,Hour
0,295665,Macbook Pro Laptop,1,1700.0,2019-12-30 00:01:00,"136 Church St, New York City, NY 10001",12,1700.0,New York City,0
1,295666,LG Washing Machine,1,600.0,2019-12-29 07:03:00,"562 2nd St, New York City, NY 10001",12,600.0,New York City,7